apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
/**************************************************************************//**
 * @file      rtl8710c_spic_type.h
 * @brief
 * @version   V1.00
 * @date      2018-1-4 15:41:32
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_SPIC_TYPE_H_
#define _RTL8710C_SPIC_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SPIC_REG_TYPE

/**
 * @addtogroup hs_hal_spic_reg SPIC Registers.
 * @ingroup hs_hal_spic
 * @{
 */

/**
  \brief Union type to access spic_ctrlr0 (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) SPIC Control Register 0                                    */
  
  struct {
    __IM  uint32_t            : 6;
    __IOM uint32_t scph       : 1;            /*!< [6..6] Serial Clock Phase.                                                */
    __IOM uint32_t scpol      : 1;            /*!< [7..7] Serial Clock Polarity.                                             */
    __IOM uint32_t tmod       : 2;            /*!< [9..8] Transfer mode.                                                     */
    __IM  uint32_t            : 6;
    __IOM uint32_t addr_ch    : 2;            /*!< [17..16] Indicate channel number of address phase in transmitting
                                                   or receiving data. Data phase is used to send data after
                                                   address phase. 0 : single channel, 1 : dual channels, 2
                                                   : quad channels, 3 : octal channel.                                       */
    __IOM uint32_t data_ch    : 2;            /*!< [19..18] Indicate channel number of data phase in transmitting
                                                   or receiving data. Data phase is used to send data after
                                                   address phase. 0 : single channel, 1 : dual channels, 2
                                                   : quad channels, 3 : octal channel.                                       */
    __IOM uint32_t cmd_ch     : 2;            /*!< [21..20] Indicate channel number of command phase in transmitting
                                                   or receiving data. Data phase is used to send data after
                                                   address phase. 0 : single channel, 1 : dual channels, 2
                                                   : quad channels, 3 : octal channel.                                       */
    __IOM uint32_t fast_rd    : 1;            /*!< [22..22] Indicate to use fast read command in user mode. If
                                                   setting to 1, SPIC would use FBAUDR to derive spi_sclk.                   */
    __IOM uint32_t ck_mtimes  : 5;            /*!< [27..23] Indicate the check time.                                         */
    __IOM uint32_t addr_ddr_en : 1;           /*!< [28..28] Enable address phase ddr mode.                                   */
    __IOM uint32_t data_ddr_en : 1;           /*!< [29..29] Enable data phase ddr mode.                                      */
    __IOM uint32_t cmd_ddr_en : 1;            /*!< [30..30] Enable command phase ddr mode. Always 2-byte command
                                                   type.                                                                     */
  } b;                                        /*!< bit fields for spic_ctrlr0 */
} spic_ctrlr0_t, *pspic_ctrlr0_t;

/**
  \brief Union type to access spic_ctrlr1 (@ 0x00000004).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000004) SPIC Control Register 1                                    */
  
  struct {
    __IOM uint32_t ndf        : 12;           /*!< [11..0] ndf                                                               */
  } b;                                        /*!< bit fields for spic_ctrlr1 */
} spic_ctrlr1_t, *pspic_ctrlr1_t;

/**
  \brief Union type to access spic_ssienr (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000008) SPIC Enable Register                                       */
  
  struct {
    __IOM uint32_t spic_en    : 1;            /*!< [0..0] Enable or disable SPIC.                                            */
    __OM  uint32_t atck_cmd   : 1;            /*!< [1..1] Set to enable ATCK_CMD implementation. After this bit
                                                   is set, SPIC would not accept any command until checking
                                                   flash is not busy or timeout.                                             */
  } b;                                        /*!< bit fields for spic_ssienr */
} spic_ssienr_t, *pspic_ssienr_t;

/**
  \brief Union type to access spic_ser (@ 0x00000010).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000010) Slave Enable Register                                      */
  
  struct {
    __IOM uint32_t ser        : 1;            /*!< [0..0] SPIC only has one slave select line. This bit should
                                                   be always set.                                                            */
  } b;                                        /*!< bit fields for spic_ser */
} spic_ser_t, *pspic_ser_t;

/**
  \brief Union type to access spic_baudr (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) Baud Rate Select Register                                  */
  
