apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IOM uint32_t txeim      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Mask 0 : spi_txeir_r interrupt
                                                   is masked 1 : spi_txeir_r interrupt is not masked                         */
    __IOM uint32_t txoim      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Mask 0 : spi_txoir_r
                                                   interrupt is masked 1 : spi_txoir_r interrupt is not masked               */
    __IOM uint32_t rxuim      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Mask 0 : spi_rxuir_r
                                                   interrupt is masked 1 : spi_rxuir_r interrupt is not masked               */
    __IOM uint32_t rxoim      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Mask 0 : spi_rxoir_r
                                                   interrupt is masked 1 : spi_rxoir_r interrupt is not masked               */
    __IOM uint32_t rxfim      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Mask 0 : spi_rxfir_r interrupt
                                                   is masked 1 : spi_rxfir_r interrupt is not masked                         */
    __IOM uint32_t fseim      : 1;            /*!< [5..5] FIFO Size Error Interrupt Mask. 0 : spi_fseir_r interrupt
                                                   is masked 1 : spi_fseir_r interrupt is not masked                         */
    __IOM uint32_t wbeim      : 1;            /*!< [6..6] Write Burst Error Interrupt Mask. 0 : spi_wbier_r interrupt
                                                   is masked 1 : spi_wbier_r interrupt is not masked                         */
    __IOM uint32_t byeim      : 1;            /*!< [7..7] Byte Enable Error Interrupt Mask 0 : spi_byeir_r interrupt
                                                   is masked 1 : spi_byeir_r interrupt is not masked                         */
    __IOM uint32_t aceim      : 1;            /*!< [8..8] Auto-check Timeout Error Interrupt Mask. 0 : spi_aceir_r
                                                   interrupt is masked 1 : spi_aceir_r interrupt is not masked               */
    __IOM uint32_t txsim      : 1;            /*!< [9..9] Transmit Split Interrupt Mask. 0 : spi_tx_sir_r interrupt
                                                   is masked 1 : spi_tx_sir_r interrupt is not masked                        */
  } b;                                        /*!< bit fields for spic_imr */
} spic_imr_t, *pspic_imr_t;

/**
  \brief Union type to access spic_isr (@ 0x00000030).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) Interrupt Status Register                                  */
  
  struct {
    __IM  uint32_t txeis      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Status after Masking 0
                                                   : spi_txeir_r interrupt is not active after masking 1 :
                                                   spi_txeir_r interrupt is active after masking                             */
    __IM  uint32_t txois      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Status after Masking
                                                   0 : spi_txoir_r interrupt is not active after masking 1
                                                   : spi_txoir_r interrupt is active after masking                           */
    __IM  uint32_t rxuis      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Status after Masking
                                                   0 : spi_rxuir_r interrupt is not active after masking 1
                                                   : spi_rxuir_r interrupt is active after masking                           */
    __IM  uint32_t rxois      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Status after Masking
                                                   0 : spi_rxoir_r interrupt is not active after masking 1
                                                   : spi_rxoir_r interrupt is active after masking                           */
    __IM  uint32_t rxfis      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Status after Masking 0 :
                                                   spi_rxfir_r interrupt is not active after masking 1 : spi_rxfir_r
                                                   interrupt is active after masking                                         */
    __IM  uint32_t fseis      : 1;            /*!< [5..5] FIFO Size Error Interrupt Status after Masking. 0 : spi_fseir_r
                                                   interrupt is not active after masking 1 : spi_fseir_r interrupt
                                                   is active after masking                                                   */
    __IM  uint32_t wbeis      : 1;            /*!< [6..6] Write Burst Error Interrupt Status after Masking. 0 :
                                                   spi_wbier_r interrupt is not active after masking 1 : spi_wbier_r
                                                   interrupt is active after masking                                         */
    __IM  uint32_t byeis      : 1;            /*!< [7..7] Byte Enable Error Interrupt Status after Masking 0 :
                                                   spi_byeir_r interrupt is not active after masking 1 : spi_byeir_r
                                                   interrupt is active after masking                                         */
    __IM  uint32_t aceis      : 1;            /*!< [8..8] Auto-check Timeout Error Interrupt Status after Masking.
                                                   0 : spi_aceir_r interrupt is not active after masking 1
                                                   : spi_aceir_r interrupt is active after masking                           */
    __IM  uint32_t txsis      : 1;            /*!< [9..9] Transmit Split Interrupt Status after Masking. 0 : spi_tx_sir_r
                                                   interrupt is not active after masking 1 : spi_tx_sir_r
                                                   interrupt is active after masking                                         */
    __IM  uint32_t rxsis      : 1;            /*!< [10..10] Receive Split Interrupt Status after Masking. 0 : spi_rx_sir_r
                                                   interrupt is not active after masking 1 : spi_rx_sir_r
                                                   interrupt is active after masking                                         */
  } b;                                        /*!< bit fields for spic_isr */
} spic_isr_t, *pspic_isr_t;

/**
  \brief Union type to access spic_risr (@ 0x00000034).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000034) Raw Interrupt Status Register                              */
  
