apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IM  uint32_t txeir      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Raw Status before Masking
                                                   0 : spi_txeir_r interrupt is not acitve before masking
                                                   1 : spi_txeir_r interrupt is acitve before masking                        */
    __IM  uint32_t txoir      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Raw Status before Masking
                                                   0 : spi_txoir_r interrupt is not acitve before masking
                                                   1 : spi_txoir_r interrupt is acitve before masking                        */
    __IM  uint32_t rxuir      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Raw Status before Masking
                                                   0 : spi_rxuir_r interrupt is not acitve before masking
                                                   1 : spi_rxuir_r interrupt is acitve before masking                        */
    __IM  uint32_t rxoir      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Raw Status before Masking
                                                   0 : spi_rxoir_r interrupt is not acitve before masking
                                                   1 : spi_rxoir_r interrupt is acitve before masking                        */
    __IM  uint32_t rxfir      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Raw Status before Masking
                                                   0 : spi_rxfir_r interrupt is not acitve before masking
                                                   1 : spi_rxfir_r interrupt is acitve before masking                        */
    __IM  uint32_t fseir      : 1;            /*!< [5..5] FIFO Size Error Interrupt Raw Status before Masking.
                                                   0 : spi_fseir_r interrupt is not acitve before masking
                                                   1 : spi_fseir_r interrupt is acitve before masking                        */
    __IM  uint32_t wbeir      : 1;            /*!< [6..6] Write Burst Error Interrupt Raw Status before Masking.
                                                   0 : spi_wbier_r interrupt is not acitve before masking
                                                   1 : spi_wbier_r interrupt is acitve before masking                        */
    __IM  uint32_t byeir      : 1;            /*!< [7..7] Byte Enable Error Interrupt Raw Status before Masking
                                                   0 : spi_byeir_r interrupt is not acitve before masking
                                                   1 : spi_byeir_r interrupt is acitve before masking                        */
    __IM  uint32_t aceir      : 1;            /*!< [8..8] Auto-check Timeout Error Interrupt Raw Status before
                                                   Masking. 0 : spi_aceir_r interrupt is not acitve before
                                                   masking 1 : spi_aceir_r interrupt is acitve before masking                */
  } b;                                        /*!< bit fields for spic_risr */
} spic_risr_t, *pspic_risr_t;

/**
  \brief Union type to access spic_txoicr (@ 0x00000038).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000038) Transmit FIFO Overflow Interrupt Clear Register            */
  
  struct {
    __IM  uint32_t txoicr     : 1;            /*!< [0..0] Clear Transmit FIFO Overflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_txo_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for spic_txoicr */
} spic_txoicr_t, *pspic_txoicr_t;

/**
  \brief Union type to access spic_rxoicr (@ 0x0000003C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */
  
  struct {
    __IM  uint32_t rxoicr     : 1;            /*!< [0..0] Clear Receive FIFO Overflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_rxo_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for spic_rxoicr */
} spic_rxoicr_t, *pspic_rxoicr_t;

/**
  \brief Union type to access spic_rxuicr (@ 0x00000040).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */
  
  struct {
    __IM  uint32_t rxuicr     : 1;            /*!< [0..0] Clear Receive FIFO Underflow Interrupt. This register
                                                   reflects the status of the interrupt. A read from this
                                                   register clears the ssi_rxu_intr interrupt; writing has
                                                   no effect.                                                                */
  } b;                                        /*!< bit fields for spic_rxuicr */
} spic_rxuicr_t, *pspic_rxuicr_t;

/**
  \brief Union type to access spic_faeicr (@ 0x00000044).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000044) Frame Alignment Interrupt Clear Register                   */
  
  struct {
    __IM  uint32_t faeicr     : 1;            /*!< [0..0] Clear Frame Alignment Interrupt. This register reflects
                                                   the status of the interrupt. A read from this register
                                                   clears the ssi_fae_intr interrupt; writing has no effect.                 */
  } b;                                        /*!< bit fields for spic_faeicr */
} spic_faeicr_t, *pspic_faeicr_t;

/**
  \brief Union type to access spic_icr (@ 0x00000048).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000048) Interrupt Clear Register                                   */
  
