apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IM  uint32_t icr        : 1;            /*!< [0..0] Clear Interrupts. This register is set if any of the
                                                   interrupts below are active. A read clears the ssi_txu_intr,
                                                   ssi_txo_intr, ssi_rxu_intr, ssi_rxo_intr, and the ssi_fae_intr
                                                   interrupts. Writing to this register has no effect.                       */
  } b;                                        /*!< bit fields for spic_icr */
} spic_icr_t, *pspic_icr_t;

/**
  \brief Union type to access spic_dmacr (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) DMA Control Register                                       */
  
  struct {
    __IOM uint32_t rx_dmac_en : 1;            /*!< [0..0] Receive DMA Enable. This bit enables/disables the receive
                                                   FIFO DMA channel 0 : Receive DMA disabled 1 : Receive DMA
                                                   enabled                                                                   */
    __IOM uint32_t tx_dmac_en : 1;            /*!< [1..1] Transmit DMA Enable. This bit enables/disables the transmit
                                                   FIFO DMA channel. 0 : Transmit DMA disabled 1 : Transmit
                                                   DMA enabled                                                               */
  } b;                                        /*!< bit fields for spic_dmacr */
} spic_dmacr_t, *pspic_dmacr_t;

/**
  \brief Union type to access spic_dmatdlr (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */
  
  struct {
    __IOM uint32_t dmatdl     : 8;            /*!< [7..0] Transmit Data Level. This bit field controls the level
                                                   at which a DMA request is made by the transmit logic. It
                                                   is equal to the watermark level; that is, the dma_tx_req
                                                   signal is generated when the number of valid data entries
                                                   in the transmit FIFO is equal to or below this field value,
                                                   and tx_dmac_en = 1.                                                       */
  } b;                                        /*!< bit fields for spic_dmatdlr */
} spic_dmatdlr_t, *pspic_dmatdlr_t;

/**
  \brief Union type to access spic_dmardlr (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) DMA Receive Data Level Register                            */
  
  struct {
    __IOM uint32_t dmardl     : 8;            /*!< [7..0] Receive Data Level. This bit field controls the level
                                                   at which a DMA request is made by the receive logic. The
                                                   watermark level = DMARDL+1; that is, dma_rx_req is generated
                                                   when the number of valid data entries in the receive FIFO
                                                   is equal to or above this field value + 1, and rx_dmac_en
                                                   = 1.                                                                      */
  } b;                                        /*!< bit fields for spic_dmardlr */
} spic_dmardlr_t, *pspic_dmardlr_t;

/**
  \brief Union type to access spic_dr_word (@ 0x00000060).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x00000060) Data Register                                              */
  
  struct {
    __IOM uint32_t word     : 32;           /*!< [31..0] Access FIFO as if its width is 4 byte per data item               */
  } b;                                        /*!< bit fields for spic_dr_word */
} spic_dr_word_t, *pspic_dr_word_t;

/**
  \brief Union type to access spic_dr_half_word (@ 0x00000060).
*/
typedef union {
  __IOM uint16_t w;                         /*!< (@ 0x00000060) Data Register                                              */
  
  struct {
    __IOM uint16_t half_word : 16;          /*!< [15..0] Access FIFO as if its width is 2 byte per data item               */
  } b;                                        /*!< bit fields for spic_dr_half_word */
} spic_dr_half_word_t, *pspic_dr_half_word_t;

/**
  \brief Union type to access spic_dr_byte (@ 0x00000060).
*/
typedef union {
  __IOM uint8_t w;                          /*!< (@ 0x00000060) Data Register                                              */
  
  struct {
    __IOM uint8_t byte      : 8;            /*!< [7..0] Access FIFO as if its width is 1 byte per data item                */
  } b;                                        /*!< bit fields for spic_dr_byte */
} spic_dr_byte_t, *pspic_dr_byte_t;

/**
  \brief Union type to access spic_read_fast_single (@ 0x000000E0).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x000000E0) Fast Read Command Register                                 */
  
  struct {
    __IOM uint32_t frd_cmd  : 8;            /*!< [7..0] Fast read command.                                                 */
  } b;                                        /*!< bit fields for spic_read_fast_single */
} spic_read_fast_single_t, *pspic_read_fast_single_t;

/**
  \brief Union type to access spic_rd_octal_io (@ 0x000000E0).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x000000E0) Fast Read Command Register                                 */
  
  struct {
    __IOM uint32_t frd_octal_cmd : 16;      /*!< [15..0] Fast read command for Octal IO mode.                              */
  } b;                                        /*!< bit fields for spic_rd_octal_io */
} spic_rd_octal_io_t, *pspic_rd_octal_io_t;

/**
  \brief Union type to access spic_read_dual_data (@ 0x000000E4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E4) Dual Read Command Register                                 */
  
