apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IOM uint32_t rd_dual_o_cmd : 8;         /*!< [7..0] Dual data read command, 1-1-2 mode.                                */
  } b;                                        /*!< bit fields for spic_read_dual_data */
} spic_read_dual_data_t, *pspic_read_dual_data_t;

/**
  \brief Union type to access spic_read_dual_addr_data (@ 0x000000E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E8) Dual IO Read Command Register                              */
  
  struct {
    __IOM uint32_t rd_dual_io_cmd : 8;        /*!< [7..0] Dual address and data read command, 1-2-2 mode.                    */
  } b;                                        /*!< bit fields for spic_read_dual_addr_data */
} spic_read_dual_addr_data_t, *pspic_read_dual_addr_data_t;

/**
  \brief Union type to access spic_read_quad_data (@ 0x000000EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000EC) Quad Read Command Register                                 */
  
  struct {
    __IOM uint32_t rd_quad_o_cmd : 8;         /*!< [7..0] Quad data read command, 1-1-4 mode.                                */
  } b;                                        /*!< bit fields for spic_read_quad_data */
} spic_read_quad_data_t, *pspic_read_quad_data_t;

/**
  \brief Union type to access spic_read_quad_addr_data (@ 0x000000F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F0) Quad IO Read Command Register                              */
  
  struct {
    __IOM uint32_t rd_quad_io_cmd : 8;        /*!< [7..0] Quad address and data read command, 1-4-4 mode.                    */
    __IM  uint32_t            : 8;
    __IOM uint32_t prm_value  : 8;            /*!< [23..16] High Performance Read Mode Control Value.                        */
  } b;                                        /*!< bit fields for spic_read_quad_addr_data */
} spic_read_quad_addr_data_t, *pspic_read_quad_addr_data_t;

/**
  \brief Union type to access spic_write_single (@ 0x000000F4).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x000000F4) Single IO Page Program Command Register                    */
  
  struct {
    __IOM uint32_t wr_cmd   : 8;            /*!< [7..0] One bit mode page program command.                                 */
  } b;                                        /*!< bit fields for spic_write_single */
} spic_write_single_t, *pspic_write_single_t;

/**
  \brief Union type to access spic_write_octal_io (@ 0x000000F4).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x000000F4) Octal IO Page Program Command Register                     */
  
  struct {
    __IOM uint32_t wr_octal_cmd : 16;       /*!< [15..0] Octal IO page program command.                                    */
  } b;                                        /*!< bit fields for spic_write_octal_io */
} spic_write_octal_io_t, *pspic_write_octal_io_t;

/**
  \brief Union type to access spic_write_dual_data (@ 0x000000F8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F8) Dual Page Program Command Register                         */
  
  struct {
    __IOM uint32_t rd_dual_io_cmd : 8;        /*!< [7..0] Dual page program command, 1-1-2 mode.                             */
  } b;                                        /*!< bit fields for spic_write_dual_data */
} spic_write_dual_data_t, *pspic_write_dual_data_t;

/**
  \brief Union type to access spic_write_dual_addr_data (@ 0x000000FC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000FC) Dual IO Page Program Command Register                      */
  
  struct {
    __IOM uint32_t wr_dual_ii_cmd : 8;        /*!< [7..0] Dual IO page program command, 1-2-2 mode.                          */
  } b;                                        /*!< bit fields for spic_write_dual_addr_data */
} spic_write_dual_addr_data_t, *pspic_write_dual_addr_data_t;

/**
  \brief Union type to access spic_write_quad_data (@ 0x00000100).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000100) Quad Page Program Command Register                         */
  
  struct {
    __IOM uint32_t wr_quad_i_cmd : 8;         /*!< [7..0] Quad page program command, 1-1-4 mode.                             */
  } b;                                        /*!< bit fields for spic_write_quad_data */
} spic_write_quad_data_t, *pspic_write_quad_data_t;

/**
  \brief Union type to access spic_write_quad_addr_data (@ 0x00000104).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000104) Quad IO Page Program Command Register                      */
  
  struct {
    __IOM uint32_t wr_quad_ii_cmd : 8;        /*!< [7..0] Quad IO page program command, 1-4-4 mode.                          */
  } b;                                        /*!< bit fields for spic_write_quad_addr_data */
} spic_write_quad_addr_data_t, *pspic_write_quad_addr_data_t;

/**
  \brief Union type to access spic_write_enable (@ 0x00000108).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000108) Write Enable Command Register                              */
  
  struct {
    __IOM uint32_t wr_en_cmd  : 16;           /*!< [15..0] Write Enable Command. The second command byte is for
                                                   DTR mode.                                                                 */
  } b;                                        /*!< bit fields for spic_write_enable */
} spic_write_enable_t, *pspic_write_enable_t;

/**
  \brief Union type to access spic_read_status (@ 0x0000010C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000010C) Read Status Command Register                               */
  
  struct {
    __IOM uint32_t rd_st_cmd  : 16;           /*!< [15..0] Read flash status register command.                               */
  } b;                                        /*!< bit fields for spic_read_status */
} spic_read_status_t, *pspic_read_status_t;

/**
  \brief Union type to access spic_ctrlr2 (@ 0x00000110).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000110) SPIC Control Register 2                                    */
  
