apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IOM uint32_t so_dnum    : 1;            /*!< [0..0] Indicate SO input pin of SPI Flash is connected to spi_sout[0]
                                                   or spi_sout[1]. Set 1 to support multi-channels connection
                                                   in default.                                                               */
    __IM  uint32_t            : 2;
    __IOM uint32_t seq_en     : 1;            /*!< [3..3] Set to enable data-split program / read.                           */
    __IOM uint32_t tx_fifo_entry : 4;         /*!< [7..4] Indicate the valid entry of transmit FIFO.                         */
    __IOM uint32_t rx_fifo_entry : 4;         /*!< [11..8] Indicate the valid entry of receive FIFO.                         */
    __IOM uint32_t cs_active_hold : 2;        /*!< [13..12] For flash chip select active hold time after SCLK resing
                                                   edge.                                                                     */
  } b;                                        /*!< bit fields for spic_ctrlr2 */
} spic_ctrlr2_t, *pspic_ctrlr2_t;

/**
  \brief Union type to access spic_fbaudr (@ 0x00000114).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000114) Fast Read Baud Rate Select Register                        */
  
  struct {
    __IOM uint32_t fsckdv     : 12;           /*!< [11..0] This register controls the frequency of spi_sclk for
                                                   fast read command. spi_sclk = frequency of bus_clk / (2*fsckdv)           */
  } b;                                        /*!< bit fields for spic_fbaudr */
} spic_fbaudr_t, *pspic_fbaudr_t;

/**
  \brief Union type to access spic_addr_length (@ 0x00000118).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000118) Address Byte Length Register                               */
  
  struct {
    __IOM uint32_t addr_phase_length : 3;     /*!< [2..0] Indicate the number of bytes in address phase. addr_phase_length
                                                   [2] is an extended bit for 4-Byte Address with PRM mode.
                                                   Set to 5, SPIC can send 4 byte address and 1 byte PRM mode
                                                   value. 3-Byte Address with PRM mode need to set this bit
                                                   to 0, SPIC can send 3byte address and 1byte PRM mode value.
                                                   1 : One byte address, 2 : Two byte address, 3 : Three byte
                                                   address, 4: Four byte address with PRM value, 0 : Four
                                                   byte address / Three bytee addree with PRM value.                         */
  } b;                                        /*!< bit fields for spic_addr_length */
} spic_addr_length_t, *pspic_addr_length_t;

/**
  \brief Union type to access spic_auto_length (@ 0x0000011C).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x0000011C) Auto Mode Address Byte Length Register                     */
  
  struct {
    __IOM uint32_t rd_dummy_length : 12;    /*!< [11..0] Indicate dummy cycles for receiving data. It is referenced
                                                 by bus_clk.                                                               */
    __IM  uint32_t          : 4;
    __IOM uint32_t auto_addr_length : 2;    /*!< [17..16] Number of address bytes in read/write command in auto
                                                 mode                                                                      */
    __IOM uint32_t auto_dum_len : 8;        /*!< [25..18] Dummy cycle is used to check flash status in auto_write
                                                 operation if delay time of read data 1 cycle.                             */
    __IOM uint32_t cs_h_rd_dum_len : 2;     /*!< [27..26] Dummy cycle between sending read command to SPI flash.
                                                 Using the dummy cycles can avoid the timing violation of
                                                 CS high time.                                                             */
    __IOM uint32_t cs_h_wr_dum_len : 4;     /*!< [31..28] Dummy cycle between sending write command to SPI flash.
                                                 Using the dummy cycles can avoid the timing violation of
                                                 CS high time.                                                             */
  } b;                                        /*!< bit fields for spic_auto_length */
} spic_auto_length_t, *pspic_auto_length_t;

/**
  \brief Union type to access spic_auto_length_seq (@ 0x0000011C).
*/
typedef union {
  __IOM uint32_t w;                         /*!< (@ 0x0000011C) Sequential Auto Mode Address Byte Length Register          */
  
  struct {
    __IOM uint32_t rd_dummy_length : 12;    /*!< [11..0] Indicate dummy cycles for receiving data. It is referenced
                                                 by bus_clk.                                                               */
    __IOM uint32_t in_physical_cyc : 4;     /*!< [15..12] Indicate how many SPIC clk cycles from pad to internal
                                                 SPIC.                                                                     */
    __IOM uint32_t auto_addr_length : 2;    /*!< [17..16] Number of address bytes in read/write command in auto
                                                 mode                                                                      */
    __IOM uint32_t spic_cyc_per_byte : 8;   /*!< [25..18] Indicate how many SPIC clk cycles for one byte. Formula
                                                 = BAUD*2*Byte / CH, the maximum value is 256                              */
    __IOM uint32_t cs_h_rd_dum_len : 2;     /*!< [27..26] Dummy cycle between sending read command to SPI flash.
                                                 Using the dummy cycles can avoid the timing violation of
                                                 CS high time.                                                             */
    __IOM uint32_t cs_h_wr_dum_len : 4;     /*!< [31..28] Dummy cycle between sending write command to SPI flash.
                                                 Using the dummy cycles can avoid the timing violation of
                                                 CS high time.                                                             */
  } b;                                        /*!< bit fields for spic_auto_length_seq */
} spic_auto_length_seq_t, *pspic_auto_length_seq_t;

/**
  \brief Union type to access spic_valid_cmd (@ 0x00000120).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000120) Valid Command Register                                     */
  
