apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_spic_type.h
  struct {
    __IOM uint32_t frd_single : 1;            /*!< [0..0] Execute fast read for auto read mode.                              */
    __IOM uint32_t rd_dual_i  : 1;            /*!< [1..1] Execute dual data write for auto read mode. (1-1-2)                */
    __IOM uint32_t rd_dual_io : 1;            /*!< [2..2] Execute dual address data read for auto read mode. (1-2-2)         */
    __IOM uint32_t rd_quad_o  : 1;            /*!< [3..3] Execute quad data write for auto read mode. (1-1-4)                */
    __IOM uint32_t rd_quad_io : 1;            /*!< [4..4] Execute quad address data read for auto read mode. (1-4-4)         */
    __IOM uint32_t wr_dual_i  : 1;            /*!< [5..5] Execute dual data write for auto write mode. (1-1-2)               */
    __IOM uint32_t wr_dual_ii : 1;            /*!< [6..6] Execute dual address data write for auto write mode.
                                                   (1-2-2)                                                                   */
    __IOM uint32_t wr_quad_i  : 1;            /*!< [7..7] Execute quad data write for auto write mode. (1-1-4)               */
    __IOM uint32_t wr_quad_ii : 1;            /*!< [8..8] Execute quad address data write for auto write mode.
                                                   (1-4-4)                                                                   */
    __IOM uint32_t wr_blocking : 1;           /*!< [9..9] Accept next operation after the write data push to FIFO
                                                   and FIFO is pop data to empty by SPIC. Should always be
                                                   1.                                                                        */
    __IM  uint32_t            : 1;
    __IOM uint32_t prm_en     : 1;            /*!< [11..11] Enable SPIC performance read mode in auto mode.                  */
    __IOM uint32_t ctrlr0_ch  : 1;            /*!< [12..12] Set this bit, then SPIC refers cmd_ch / data_ch / addr_en
                                                   / cmd_ddr_en / data_ddr_en / addr_ddr_en bit fields in
                                                   Control Register 0 in auto mode.                                          */
    __IM  uint32_t            : 1;
    __IOM uint32_t seq_trans_en : 1;          /*!< [14..14] Set 1 to enable read sequential transaction determination
                                                   function. If the auto read address is sequenctial, users
                                                   can save command phase and address phase under this mode.                 */
  } b;                                        /*!< bit fields for spic_valid_cmd */
} spic_valid_cmd_t, *pspic_valid_cmd_t;

/**
  \brief Union type to access spic_flash_size (@ 0x00000124).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000124) Write Enable Command Register                              */
  
  struct {
    __IOM uint32_t flash_size : 4;            /*!< [3..0] The size of flash size to select the target SPI flash
                                                   in auto mode.                                                             */
  } b;                                        /*!< bit fields for spic_flash_size */
} spic_flash_size_t, *pspic_flash_size_t;

/**
  \brief Union type to access spic_flush_fifo (@ 0x00000128).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000128) Read Status Command Register                               */
  
  struct {
    __OM  uint32_t flush_fifio : 1;           /*!< [0..0] Write to flush SPIC FIFO.                                          */
  } b;                                        /*!< bit fields for spic_flush_fifo */
} spic_flush_fifo_t, *pspic_flush_fifo_t;

/** @} */ /* End of group ls_hal_spic_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SPIC_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_SPIC_TYPE_H_

